## Nama : Zulfa Akfi Fikrina
## NIM  : 200601110118

## Pengertian dan Kegunaan PANDAS

In [ ]:
PANDAS adalah sebuah librari dan open source yang menyediakan struktur serta analisis data yang dapat digunakan untuk 
mengkonversi data mentah sehingga memudahkan untuk menganalisis data.struktur data dasar pandas dinamakan DataFrame yaitu 
koleksi kolom berurutan dengan bentuk sebuah tabel yang memudahkan untuk membaca sebuah file dan menjadikannya table.
beberapa kegunaan pandas yaitu kita dapat membaca dan menuliskan data dalam bentuk csv file yang lainnya dan database, 
kita juga dapat membuat file excel, csxc dan lain sebagainya, penghitungan statistik, menghilangkan beberapa value yang 
kurang memenuhi, vissualisasi data, mengolah data.

## Komponen Utama PANDAS

In [ ]:
1. series dan DataFrame.
pembuatan DataFrame bisa dilakukan di Python langsung atau langsung upload file txt/excel.

In [17]:
import pandas as pd

In [18]:
data = {
    'apples': [3, 2, 0, 1],
    'oranges': [0, 3, 7, 2]
}

purchases = pd.DataFrame(data)
print(purchases)

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [20]:
purchases = pd.DataFrame(data,
index=['June', 'Robert', 'Lily', 'David'])
print(purchases.loc['Robert'])

apples     2
oranges    3
Name: Robert, dtype: int64

## Penambahan Kolom Baru

In [22]:
df = pd.DataFrame({'celcius': [17.0, 25.0]},
                  index=['Bantul', 'Sleman'])
print(df)

        celcius
Bantul     17.0
Sleman     25.0

In [24]:
df=df.assign(fah=df['celcius']*9/5+32)
print(df)

        celcius   fah
Bantul     17.0  62.6
Sleman     25.0  77.0

In [26]:
df=df.assign(rea=lambda x:x.celcius*4/5)
print(df)

        celcius   fah   rea
Bantul     17.0  62.6  13.6
Sleman     25.0  77.0  20.0

## Apply Function

In [27]:
df=pd.DataFrame({'nama':['andi', 'rudi', 'siti', 'ani'],
                 'ipk':[2.3,3.1,1.8,2.9]})
print(df)

   nama  ipk
0  andi  2.3
1  rudi  3.1
2  siti  1.8
3   ani  2.9

In [29]:
def group_nilai(a):
    if a > 2.75:
        hasil="Bagus"
    elif a > 2.5:
        hasil="Cukup"
    else:
        hasil="Kurang"
    return hasil
df=df.assign(status=df['ipk'].apply(group_nilai))
print(df)

   nama  ipk  status
0  andi  2.3  Kurang
1  rudi  3.1   Bagus
2  siti  1.8  Kurang
3   ani  2.9   Bagus

## import .txt

In [34]:
data1=pd.read_csv("C:\\Users\\Acer\\Documents\\pandas\\data.txt")
print(data1)

   A\tB
0  1\t2
1  4\t3
2  4\t2

In [35]:
data2=pd.read_csv("C:\\Users\\Acer\\Documents\\pandas\\data.txt", delimiter="\t")
print(data2)

   A  B
0  1  2
1  4  3
2  4  2

## import .csv

In [36]:
data3=pd.read_csv("C:\\Users\\Acer\\Documents\\pandas\\data.txt")
print(data3)

   A\tB
0  1\t2
1  4\t3
2  4\t2

In [37]:
data4=pd.read_csv("C:\\Users\\Acer\\Documents\\pandas\\data.txt", delimiter="\s+")
print(data4)

   A  B
0  1  2
1  4  3
2  4  2

## import .xlsx

In [38]:
data5=pd.read_excel('C:\\Users\\Acer\\Documents\\pandas\\data.xlsx')
print(data5)

   A  B
0  1  2
1  4  3
2  4  2

## import .xls

In [39]:
data6=pd.read_excel('C:\\Users\\Acer\\Documents\\pandas\\data.xls')
print(data6)

   A  B
0  1  2
1  4  3
2  4  2

## Melihat Tabel

In [40]:
#semua
data2

   A  B
0  1  2
1  4  3
2  4  2

In [41]:
#sebagian yang diatas (karena datanya sedikit maka yang tampil semua, silahkan coba dengan data yang lebih banyak lagi sendiri)
data2.head()

   A  B
0  1  2
1  4  3
2  4  2

## Membuat DataFrame sendiri

In [42]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [43]:
data = [1,2,3,4,5]
df1 = pd.DataFrame(data)
print(df1)

   0
0  1
1  2
2  3
3  4
4  5

In [44]:
data = [['Purwanto',32],['Purnomo',43],['Purwo',55]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [45]:
import pandas as pd
import numpy as np

## Memanggil data tertentu pada DataFrame

In [46]:
data = [['Purwanto',32],['Purnomo',43],['Purwo',55]]
df2 = pd.DataFrame(data,columns=['Nama','Usia'])
print(df2)

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [47]:
df2["Nama"]

0    Purwanto
1     Purnomo
2       Purwo
Name: Nama, dtype: object

In [48]:
df2["Usia"]

0    32
1    43
2    55
Name: Usia, dtype: int64

In [49]:
df2["Nama"][0]

'Purwanto'

In [50]:
df2.iloc[0][0]

'Purwanto'

In [51]:
df2.loc[0]["Nama"]

'Purwanto'

In [52]:
df2.at[0,"Nama"]

'Purwanto'

In [53]:
df2.iat[0,0]

'Purwanto'

In [54]:
df2.iloc[0]

Nama    Purwanto
Usia          32
Name: 0, dtype: object

In [55]:
df2.loc[:,'Nama']

0    Purwanto
1     Purnomo
2       Purwo
Name: Nama, dtype: object

## Set Index

In [56]:
df3 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df3

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [57]:
df3.set_index("Nama")

          Usia
Nama
Purwanto    32
Purnomo     43
Purwo       55

## Pemanggilan Baris

In [58]:
df4 = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]), index= [2, 'A', 4], columns=[48, 49, 50])
df4

   48  49  50
2   1   2   3
A   4   5   6
4   7   8   9

In [59]:
df4.loc[2]

48    1
49    2
50    3
Name: 2, dtype: int32

In [60]:
df4.iloc[2]

48    7
49    8
50    9
Name: 4, dtype: int32

## Menambah Kolom

In [61]:
#Menambahkan index di kolom baru
df5 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df5["Index"]=df5.index
df5

       Nama  Usia  Index
0  Purwanto    32      0
1   Purnomo    43      1
2     Purwo    55      2

In [62]:
#Menambahkan kolom dengan isian baru
df5.loc[:, "Gender"] = pd.Series(['L','L','L'])
df5

       Nama  Usia  Index Gender
0  Purwanto    32      0      L
1   Purnomo    43      1      L
2     Purwo    55      2      L

## Melihat ukuran DataFrame

In [63]:
#ukuran baris paling panjang
len(df2)

3

In [64]:
#ukuran baris pada kolom tertentu
len(df2["Nama"])

3

In [65]:
#ukuran baris, ukuran kolom dataframe
print(df2.shape)

(3, 2)

## Menghapus

In [66]:
df6 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df6

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [71]:
#menghapus kolom
del df6['Nama']
df6

   Usia
1    43

In [68]:
#Menghapus n baris di awal
df6=df6[2:]
df6

   Usia
2    55

In [69]:
df6 = pd.DataFrame([['Purwanto',32],['Purnomo',43],['Purwo',55]],columns=['Nama','Usia'])
df6

       Nama  Usia
0  Purwanto    32
1   Purnomo    43
2     Purwo    55

In [70]:
#Menghapus baris tertentu
df6=df6.drop(df6.index[[0,2]])
df6

      Nama  Usia
1  Purnomo    43

## Ekspor DataFrame

In [72]:
#import pandas dan numpy
import pandas as pd
import numpy as np
#Misal kita punya suatu dataframe
data = [[1,32],[2,43],[4,55]]
df = pd.DataFrame(data,columns=['Nama','Usia'])
#Convert ke numpy array
databaru = df.to_numpy()
print(databaru)
#Convert ke txt
df.to_csv("dataexport.txt")
#Convert ke csv
df.to_csv("dataexport.csv")
#Convert ke xlsx
writer = pd.ExcelWriter('dataexport.xlsx')
df.to_excel(writer, 'DataFrame')
writer.save()

[[ 1 32]
 [ 2 43]
 [ 4 55]]